In [2]:
import pandas as pd
import numpy as np

In [3]:
sales = pd.read_csv("sales.txt")

In [4]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   JAN  B300  VZG   20.0
2   FEB  B100  VZG    4.0
3   MAR  B100  VZG   13.0
4   JAN  B100  HYD   30.0
5   FEB  B100  HYD   40.0
6   MAR  B100  HYD   10.0
7   JAN  B200  VZG   14.0
8   FEB  B200  HYD    NaN
9   MAR  B200  NaN    4.0

In [5]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Month    10 non-null object
Book     10 non-null object
City     9 non-null object
Units    9 non-null float64
dtypes: float64(1), object(3)
memory usage: 400.0+ bytes

### selecting rows and columns

In [24]:
sales[['Month','Units']][:2]

  Month  Units
0   JAN   10.0
1   JAN   20.0

In [25]:
sales[:3]

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   JAN  B300  VZG   20.0
2   FEB  B100  VZG    4.0

In [12]:
sales.iloc[:5, :2]

  Month  Book
0   JAN  B100
1   JAN  B300
2   FEB  B100
3   MAR  B100
4   JAN  B100

In [22]:
sales.iloc[[0,4,6], [0,3]]

  Month  Units
0   JAN   10.0
4   JAN   30.0
6   MAR   10.0

In [20]:
sales.loc[:3, 'Month' :'City']

  Month  Book City
0   JAN  B100  VZG
1   JAN  B300  VZG
2   FEB  B100  VZG
3   MAR  B100  VZG

In [18]:
sales.loc[:3, ['Month','Units']]

  Month  Units
0   JAN   10.0
1   JAN   20.0
2   FEB    4.0
3   MAR   13.0

In [21]:
sales.loc[ [1,4,7], ['Month','Units']]

  Month  Units
1   JAN   20.0
4   JAN   30.0
7   JAN   14.0

In [27]:
sales.iat[0,2]

'VZG'

In [28]:
sales.at[0,'City']

'VZG'